spec/fixtures/stripe/payment_intent_event_payment_request.json

{
  "id": "evt_1LCflrDu4p87RxPw3rxrRLSc",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1655712943,
  "data": {
    "object": {
      "id": "pi_1JKS2Y2VYugoKSBzNHPFBNj9",
      "object": "payment_intent",
      "amount": 1000,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {}
      },
      "amount_received": 0,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [],
        "has_more": false,
        "url": "/v1/charges?payment_intent=pi_1JKS2Y2VYugoKSBzNHPFBNj9"
      },
      "client_secret": "pi_1JKS2Y2VYugoKSBzNHPFBNj9_secret_niLMVIt33lBGf0z6Gt5WIGc3C",
      "confirmation_method": "automatic",
      "created": 1628014114,
      "currency": "usd",
      "customer": null,
      "description": "Created by stripe.com/docs demo",
      "invoice": null,
      "last_payment_error": null,
      "livemode": false,
      "metadata": {
        "lago_payment_request_id": "a587e552-36bc-4334-81f2-abcbf034ad3f",
        "lago_payable_type": "PaymentRequest"
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "processing": null,
      "receipt_email": null,
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "success",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 0,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "payment_intent.succeeded"
}
